In [2]:
import pandas as pd

In [17]:
chicago = pd.read_csv("chicago.csv").dropna(how = "all")

In [18]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1.2+ MB

In [19]:
chicago.nunique()

Name                      31776
Position Title             1093
Department                   35
Employee Annual Salary     1156
dtype: int64

In [20]:
# Changing departmenr as a new category
chicago["Department"] = chicago["Department"].astype("category")

In [21]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [22]:
"hello World".title()

'Hello World'

In [23]:
# We cannot directly apply lower,upper, title to a dataframe so we use str
chicago["Name"].str.lower()

0            aaron,  elvia j
1          aaron,  jeffery m
2             aaron,  karina
3        aaron,  kimberlei r
4        abad jr,  vicente m
                ...
32057    zygadlo,  michael j
32058     zygowicz,  peter j
32059      zymantas,  mark e
32060    zyrkowski,  carlo e
32061    zyskowski,  dariusz
Name: Name, Length: 32062, dtype: object

In [24]:
# len will return the rows but
chicago["Department"].str.len() # This would return all the characters length of all the department

0        11
1         6
2         6
3        16
4        11
         ..
32057    16
32058     6
32059     6
32060     6
32061     4
Name: Department, Length: 32062, dtype: int64

In [25]:
"Hello World".replace('l','!')

'He!!o Wor!d'

In [27]:
chicago["Department"] = chicago["Department"].str.replace("MGMNT","MANAGEMENT")

In [28]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MANAGEMENT,$106836.00

In [30]:
mask = chicago["Position Title"].str.lower().str.contains("water")
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,$90744.00
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,$102440.00
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MANAGEMENT,$82044.00
685,"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MANAGEMENT,$109272.00
702,"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,$102440.00
...,...,...,...,...
29669,"VERMA, ANUPAM",MANAGING ENGINEER - WATER MANAGEMENT,WATER MANAGEMENT,$111192.00
30239,"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MANAGEMENT,$89676.00
30544,"WEST, THOMAS R",GEN SUPT OF WATER MANAGEMENT,WATER MANAGEMENT,$115704.00
30991,"WILLIAMS, MATTHEW",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,$102440.00
31405,"WOODRIDGE, ROBERT L",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,$102440.00

In [32]:
mask = chicago["Position Title"].str.lower().str.startswith("water")
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,$90744.00
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MANAGEMENT,$82044.00
1054,"ASHLEY, KARMA T",WATER CHEMIST II,WATER MANAGEMENT,$82044.00
1079,"ATKINS, JOANNA M",WATER CHEMIST II,WATER MANAGEMENT,$82044.00
1181,"AZEEM, MOHAMMED A",WATER CHEMIST II,WATER MANAGEMENT,$53172.00
...,...,...,...,...
28574,"THREATT, DENISE R",WATER QUALITY INSPECTOR,WATER MANAGEMENT,$62004.00
28602,"TIGNOR, DARRYL B",WATER RATE TAKER,WATER MANAGEMENT,$78948.00
28955,"TRAVIS COOK, LESLIE R",WATER RATE TAKER,WATER MANAGEMENT,$78948.00
29584,"VELAZQUEZ, JOHN",WATER RATE TAKER,WATER MANAGEMENT,$78948.00
30239,"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MANAGEMENT,$89676.00

In [33]:
mask = chicago["Position Title"].str.lower().str.endswith("water")
chicago[mask]

Empty DataFrame
Columns: [Name, Position Title, Department, Employee Annual Salary]
Index: []

# Removing whitespaces from the beginning and last

In [37]:
print("                   Hello   World       ".strip())
print("                   Hello   World       ".rstrip())
print("                   Hello   World       ".lstrip())

Hello   World
                   Hello   World
Hello   World

In [39]:
chicago["Name"] = chicago["Name"].str.lstrip().str.rstrip()

In [40]:
chicago["Position Title"] = chicago["Position Title"].str.lstrip().str.rstrip()